{
  "scenes": {
    "scene-space-hospital": {
      "name": "Space-Hospital",
      "items": [
        "item-screwdriver",
        "item-hammer",
        "item-wires"
      ],
      "characters": [
        "character-space-horse",
        "character-space-horse-confused",
        "character-space-horse-shocked",
        "character-doctor"
      ],
      "dialogues": [
        "dialogue-basic",
        "dialogue-space-hospital"
      ]
    }
  },
  "items": {
    "item-screwdriver": {
      "name": "screwdriver",
      "x": 100,
      "y": 50,
      "image": "img/screwdriver.png"
    },
    "item-hammer": {
      "name": "hammer",
      "x": 50,
      "y": 100,
      "image": "img/hammer.png"
    },
    "item-wires": {
      "name": "wires",
      "x": 75,
      "y": 75,
      "image": "img/wires.png"
    }
  },
  "characters": {
    "character-space-horse": {
      "name": "Space Horse",
      "x": 25,
      "y": 25,
      "image": "img/SpaceHorse.png"
    },
    "character-space-horse-confused": {
      "name": "Confused Space Horse",
      "x": 25,
      "y": 25,
      "image": "img/ConfusedSpaceHorse.png"
    },
    "character-space-horse-shock": {
      "name": "Shocked Space Horse",
      "x": 25,
      "y": 25,
      "image": "img/ShockedSpaceHorse.png"
    },
    "character-doctor":{
      "name": "Doctor",
      "x": 45,
      "y": 25,
      "image": "img/Doctor.png"
    }
  },
  "portals": {
    "portal-1": {
      "to": [
        "scene-1",
        "scene-2"
      ]
    }
  },
  "dialogues": {
    "dialogue-basic": {
      "text": [
        "Added to inventory",
        "You still have items to find"
      ]
    },
    "dialogue-space-hosptial": {
      "text": [
        "What. The. Fuck",
        "Hello Space Horse",
        "Who is Space Horse? I'm Keith from Slough",
        "I hate to tell you this, but you were in a major car accident, however we have performed life saving surgery, with one implication",
        "What implication?",
        "You're a horse",
        "Space Horse was in shock. How was he a horse? Where is he? Sure technology was advanced but he never knew of someone becoming a horse?!",
        "As Space Horse slept, the doctor had a worrying realisation",
        "When transferring Space Horse's brain to his new body, I accidentally transferred the horse brain to a human...",
        "Space Horse, I have a mission for you",
        "What do you mean a fucking mission? I'm not some 007 shit, I'm KEITH from SLOUGH",
        "I accidentally gave your old body a horse brain, and this human used his new opposable thumbs to start one of two time machines and is now causing trouble all across history by leaving items from our time period to stop these historic moments in time. Your mission is to go and stop him by collecting these items.",
        "However, he did break our other time machine, but I believe the parts are scattered around this hospital room to rebuild it! Best of luck!"
      ]
    },
    "dialogue-dinosaur": {
      "text-diplodocus": [
        "Hello there, I am Duchess Diplodocus! How may I help you dear today?",
        "Uhh, have you seen a human round here recently?",
        "What's a human?",
        "Walks on two legs, has arms, pretty short?",
        "All i know similiar to that is a stenonychosaurus",
        "Yeh sure",
        "Well yes then! There was one here earlier, though it made a very weird, un-stenonychosaurus like noise",
        "What sort of noise?",
        "NEIGHHHHHHHHHHHHHHHHHHHHH",
        "Uh yeh, that's the guy I'm looking for? Did he do anything weird?",
        "He dropped something the started attracting all the rocks, and something that looked like a carved stick",
        "Okay, I'll have a search around"
      ],
      "text-triceratops": [
        "ROAR roar roar",
        "What the fuck, I can't communicate to this guy",
        "Jokes on you fam, I can speak yo language",
        "Oh haha, funny",
        "Innit bruv, what you doing down these ends",
        "I still can't communicate with you",
        "Alright, alright, allow it. Who the hell are you?",
        "Uh I'm a horse? Have you seen any weird things around recently?",
        "Okay thanks!"
      ]
    }
  }
}
